## Московский авиационный институт
## (Национальный исследовательский университет)

### Лабораторная работа №7
### "Pandas"

### Выполнила: студентка группы Т12О-101М-20
### Лёдова Кристина Владимировна
### Преподаватель: Поповкин Александр Викторович
### Москва
### 2020 г.

In [2]:
import sys
import pandas as pd
import numpy as np
import random
import matplotlib.pyplot as plt

1.Прочитать файл CSV и перевести его в DataFrame
(https://raw.githubusercontent.com/Grossmend/CSV/master/titanic/data.csv)

In [8]:
data = pd.read_csv('https://raw.githubusercontent.com/Grossmend/CSV/master/titanic/data.csv')
data

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

2.Прочитать файл CSV (определенные столбцы и определенное кол-во строк: 'Name', 'Sex', 'Survived') и перевести его в DataFrame

In [7]:
data = pd.read_csv('https://raw.githubusercontent.com/Grossmend/CSV/master/titanic/data.csv', 
                 nrows = 100, usecols = ['Name', 'Sex', 'Survived'] )
data

    Survived                                               Name     Sex
0          0                            Braund, Mr. Owen Harris    male
1          1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2          1                             Heikkinen, Miss. Laina  female
3          1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4          0                           Allen, Mr. William Henry    male
..       ...                                                ...     ...
95         0                        Shorney, Mr. Charles Joseph    male
96         0                          Goldschmidt, Mr. George B    male
97         1                    Greenfield, Mr. William Bertram    male
98         1               Doling, Mrs. John T (Ada Julia Bone)  female
99         0                                  Kantor, Mr. Sinai    male

[100 rows x 3 columns]

3.Прочитать файл CSV и перевести каждую 100-ую строку в DataFrame

In [ ]:
data = pd.read_csv('https://raw.githubusercontent.com/Grossmend/CSV/master/titanic/data.csv', chunksize=100)
data_df = pd.DataFrame()
for elem in data:
    data_df = data_df.append(elem.iloc[0,:])
data_df

      Age    Cabin Embarked  ...  SibSp Survived             Ticket
0    22.0      NaN        S  ...    1.0      0.0          A/5 21171
100  28.0      NaN        S  ...    0.0      0.0             349245
200  28.0      NaN        S  ...    0.0      0.0             345770
300   NaN      NaN        Q  ...    0.0      1.0               9234
400  39.0      NaN        S  ...    0.0      1.0  STON/O 2. 3101289
500  17.0      NaN        S  ...    0.0      0.0             315086
600  24.0      NaN        S  ...    2.0      1.0             243847
700  18.0  C62 C64        C  ...    1.0      1.0           PC 17757
800  34.0      NaN        S  ...    0.0      0.0             250647

[9 rows x 12 columns]

4.Преобразовать индексы объекта Series в столбец DataFrame

In [15]:
s = pd.Series(list('abcdefg'))
print(s)

df = s.to_frame()

df['index'] = s.index
df

0    a
1    b
2    c
3    d
4    e
5    f
6    g
dtype: object

   0  index
0  a      0
1  b      1
2  c      2
3  d      3
4  e      4
5  f      5
6  g      6

5.Посмотреть информацию объекта DataFrame. Вывести формат каждого столбца

In [11]:
data = pd.read_csv('https://raw.githubusercontent.com/Grossmend/CSV/master/titanic/data.csv', nrows=10)
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

6.Вывести размерность DataFrame

In [12]:
data.shape

(10, 12)

7.Вывести общую статистику

In [13]:
data.describe()

       PassengerId   Survived     Pclass  ...      SibSp      Parch       Fare
count     10.00000  10.000000  10.000000  ...  10.000000  10.000000  10.000000
mean       5.50000   0.500000   2.300000  ...   0.700000   0.300000  27.020820
std        3.02765   0.527046   0.948683  ...   0.948683   0.674949  23.601938
min        1.00000   0.000000   1.000000  ...   0.000000   0.000000   7.250000
25%        3.25000   0.000000   1.250000  ...   0.000000   0.000000   8.152075
50%        5.50000   0.500000   3.000000  ...   0.500000   0.000000  16.104150
75%        7.75000   1.000000   3.000000  ...   1.000000   0.000000  46.414575
max       10.00000   1.000000   3.000000  ...   3.000000   2.000000  71.283300

[8 rows x 7 columns]